### 1. Series之间运算，遵循索引对齐

In [1]:
from pandas import Series, DataFrame
import pandas as pd

series1 = Series([10, 20, 30, 40], index=list('abcd'))
series2 = Series([20, 30, 40, 50], index=list('bcde'))
# 如果索引并不重叠，则使用NaN
series1 + series2

a     NaN
b    40.0
c    60.0
d    80.0
e     NaN
dtype: float64

### 2. DataFrame运算会对齐行和列索引

In [19]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

data_frame1 = DataFrame(
    np.arange(12).reshape((3, 4)), 
    index=['fir', 'sec', 'thr'], 
    columns=['a', 'b', 'c', 'd']
)

data_frame2 = DataFrame(
    np.arange(8, 20).reshape((4, 3)), 
    index=['fir', 'sec', 'thr', 'for'], 
    columns=['a', 'b', 'c']
)

In [20]:
data_frame1

     a  b   c   d
fir  0  1   2   3
sec  4  5   6   7
thr  8  9  10  11

In [21]:
data_frame2

      a   b   c
fir   8   9  10
sec  11  12  13
thr  14  15  16
for  17  18  19

In [22]:
# data_frame1 + data_frame2
# 在算数方法中填充值,当某个标签在另一个对象中找不到时填充一个值。
data_frame1.add(data_frame2, fill_value=0)

        a     b     c     d
fir   8.0  10.0  12.0   3.0
for  17.0  18.0  19.0   NaN
sec  15.0  17.0  19.0   7.0
thr  22.0  24.0  26.0  11.0

### 3. DataFrame和Series之间的运算

In [4]:
import numpy as np
data_frame2 = DataFrame(np.arange(9).reshape((3, 3)), 
                        index=['a', 'b', 'c'], 
                        columns=['num1', 'num2', 'num3'])

series2 = Series([10, 20, 30, 40], 
                 index=['num1', 'num2', 'num3', 'num4'])
data_frame2

   num1  num2  num3
a     0     1     2
b     3     4     5
c     6     7     8

In [5]:
series2

num1    10
num2    20
num3    30
num4    40
dtype: int64

In [6]:
# DataFrame每一行都加上series
data_frame2 + series2

   num1  num2  num3  num4
a    10    21    32   NaN
b    13    24    35   NaN
c    16    27    38   NaN

In [10]:
# DataFrame每一列加上series
series3 = Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
data_frame2.add(series3, axis=0)

   num1  num2  num3
a  10.0  11.0  12.0
b  23.0  24.0  25.0
c  36.0  37.0  38.0
d   NaN   NaN   NaN